{
  "backend/main.mo": "Main Motoko actor for the lottery system, defining all core types (UserRecord, LotteryPool, Ticket, WalletTransaction, etc.) and including authorization and blob-storage mixins.",
  "feature_evidence.json": "Feature evidence report confirming that LotteryManagement.tsx was updated to allow winner payout up to 90% (from 70%), with updated helper text, validation, and system profit summary.",
  "frontend-file-summaries.txt": "JSON map of short summaries for each frontend source file, describing the purpose and key implementation details of each page, hook, and component.",
  "frontend/index.css": "Global Tailwind CSS entry point defining CSS custom properties for light and dark theme color tokens (background, foreground, primary, sidebar, charts, etc.).",
  "frontend/index.html": "Minimal HTML shell for the React app, mounting the root div and loading the main TSX entry point as an ES module.",
  "frontend/src/App.tsx": "Root React app file that sets up TanStack Router with all user and admin routes, an ErrorBoundary, auth/admin guards, and wraps the app in QueryClient, ThemeProvider, and AuthProvider.",
  "frontend/src/components/AdminActionLogsTable.tsx": "Table component that fetches and displays admin action logs (block/unblock/role change) sorted by timestamp, with loading skeletons and empty state.",
  "frontend/src/components/BlockUserModal.tsx": "Modal dialog for blocking a user with an optional reason field, calling the useBlockUser mutation and showing success/error toasts on completion.",
  "frontend/src/components/CountdownTimer.tsx": "A React countdown timer component that calculates and displays time remaining until a target bigint timestamp, updating every second and showing urgency styling when under 1 hour.",
  "frontend/src/components/CreatePromotionDialog.tsx": "A dialog form component for creating new promotions with fields for type, description, discount/bonus amounts, and start/end times, using the useCreatePromotion mutation hook.",
  "frontend/src/components/CreditCoinsModal.tsx": "A modal dialog that allows admins to credit a specified coin amount to a selected user, with quick-amount buttons and a description field, using the useGrantAdminBonus hook.",
  "frontend/src/components/EditPromotionDialog.tsx": "A dialog form for editing an existing promotion's description, discount, bonus amount, and time fields, pre-populated from the promotion prop and submitted via the useUpdatePromotion hook.",
  "frontend/src/components/LoadingSpinner.tsx": "Exports a configurable spinning loader component in three sizes and a full-page PageLoader wrapper centered on screen.",
  "frontend/src/components/LotteryCard.tsx": "Displays a lottery's details (name, prize pool, ticket price, fill progress, draw time) in a card layout, using live stats from useGetLotteryLiveStats and badge styling based on draw interval.",
  "frontend/src/components/Navbar.tsx": "A sticky top navigation bar with logo, authenticated/unauthenticated nav links, an admin panel link, coin balance display, and login/logout functionality via Internet Identity.",
  "frontend/src/components/NumberPicker.tsx": "A multi-digit number input component that renders individual digit boxes with keyboard navigation, backspace handling, and paste support, grouped visually with dashes.",
  "frontend/src/components/PaymentProofUpload.tsx": "A file upload component for payment proof images that supports drag-and-drop and click-to-upload, converts the file to base64, and shows a preview with a clear button.",
  "frontend/src/components/ProfileSetupModal.tsx": "A modal dialog that prompts new users to enter a display name and email, then saves the profile via the backend actor, with error handling for uninitialized accounts.",
  "frontend/src/components/PromotionBanner.tsx": "A styled banner component that displays promotion details (type, discount, bonus, description, end date) with type-specific icons, labels, and color schemes.",
  "frontend/src/components/QuickCreditCoinsCard.tsx": "An admin card component with a searchable user selector and amount/description inputs that allows instantly crediting coins to a selected user via the grantAdminBonus mutation.",
  "frontend/src/components/TicketCard.tsx": "Displays a single lottery ticket's details including ticket number, purchase date, and winner status with prize amount, linking to the results page for winning tickets.",
  "frontend/src/components/ToastContainer.tsx": "A fixed-position toast notification container that renders success, error, and info toasts from the ToastContext with icons and a dismiss button.",
  "frontend/src/components/TransactionRow.tsx": "Renders a single transaction row with an icon, label, amount, and date based on transaction type (win, buy_ticket, withdraw, bonuses, etc.). Supports navigation to related lottery pool pages via an external link icon.",
  "frontend/src/components/UnblockUserModal.tsx": "A confirmation dialog modal that allows admins to unblock a user by calling the useUnblockUser mutation, showing loading state and success/error toasts.",
  "frontend/src/contexts/AuthContext.tsx": "Provides authentication context for both Internet Identity users and admin sessions, handling profile fetching, admin login/logout with SHA-256 password hashing, and session token persistence in localStorage with an 8-hour expiry.",
  "frontend/src/contexts/ToastContext.tsx": "Provides a toast notification context with methods for showing success, error, and info toasts that auto-dismiss after 4 seconds.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an ICP backend actor using the current Internet Identity, initializing access control with an admin token and invalidating dependent queries whenever the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity authentication provider and hook using DFINITY's AuthClient, managing login/logout state, identity persistence, and delegation validity checks.",
  "frontend/src/hooks/useQueries.ts": "Centralizes all React Query hooks for backend interactions including user profile CRUD, admin login, lottery pool management, ticket purchases, user administration, and transaction history.",
  "frontend/src/index.css": "Global stylesheet that imports Google Fonts (Playfair Display, Inter), sets up Tailwind base/components/utilities, defines CSS custom properties for a dark gold-themed design system, and adds custom utility classes and keyframe animations.",
  "frontend/src/lib/utils.ts": "Utility module exporting a Tailwind class merger (cn), and formatting helpers for coin amounts, dates, time remaining, and draw interval labels/colors.",
  "frontend/src/main.tsx": "React app entry point that wraps the App component with TanStack Query and Internet Identity providers and mounts it to the DOM.",
  "frontend/src/pages/AddBalance.tsx": "Page component allowing users to submit a coin balance top-up request by entering an amount and a payment screenshot URL, with quick-select amount buttons and a success confirmation state.",
  "frontend/src/pages/admin/AdminDashboard.tsx": "Admin dashboard page displaying platform stats (revenue, active users, lotteries, pending approvals) and quick-action links to key admin sections, plus a quick coin credit card.",
  "frontend/src/pages/admin/AdminLogin.tsx": "Admin login page with an Admin ID and password form, redirecting authenticated admins to the dashboard and displaying error messages on failed login attempts.",
  "frontend/src/pages/admin/BalanceRequests.tsx": "Admin page for reviewing user balance top-up requests, with filterable status tabs and approve/reject actions including optional notes per request.",
  "frontend/src/pages/admin/DrawDeclaration.tsx": "Admin page for declaring lottery draw results by selecting an active lottery pool and entering a winning number, then displaying the resulting prize breakdown and winners.",
  "frontend/src/pages/admin/LotteryManagement.tsx": "Admin page for creating and updating lottery pools, with a form that includes prize ratio configuration, payout validation, and a calculated summary of pool distribution.",
  "frontend/src/pages/admin/Promotions.tsx": "Admin page for managing promotions, allowing creation, editing, deactivation, and manual coin grants to users via a bonus form and promotion table.",
  "frontend/src/pages/admin/UserManagement.tsx": "Admin page for listing, searching, blocking/unblocking, assigning roles, and crediting coins to users.",
  "frontend/src/pages/admin/WithdrawalManagement.tsx": "Admin page for reviewing and processing user withdrawal requests, with filter tabs for pending/completed/rejected statuses and approve/reject actions.",
  "frontend/src/pages/BuyTicket.tsx": "Page component for purchasing a lottery ticket for a specific pool, supporting manual or auto-generated ticket numbers, displaying live pool stats, applicable promotions/discounts, and enforcing per-user ticket limits and balance checks.",
  "frontend/src/pages/DrawResults.tsx": "Page component that displays the draw results for a specific lottery, showing the winning number, total tickets, prize distributed, and a ranked winners list with medal-style styling.",
  "frontend/src/pages/Landing.tsx": "Marketing landing page featuring a hero section, platform stats banner, and feature highlights promoting the LuckyCoins blockchain lottery platform.",
  "frontend/src/pages/Login.tsx": "Login page that authenticates users via Internet Identity, redirecting to the dashboard on success and displaying security info and an admin portal link.",
  "frontend/src/pages/LotteryList.tsx": "Displays a searchable, filterable grid of active lottery pools fetched from the backend, with interval-based filter chips and skeleton loading states.",
  "frontend/src/pages/MyTickets.tsx": "Shows the authenticated user's tickets organized into All, Won, and Pending tabs, along with summary stats for total tickets, wins, and winnings.",
  "frontend/src/pages/Register.tsx": "Registration page that uses Internet Identity login to create a new account, redirecting to the dashboard upon successful authentication.",
  "frontend/src/pages/TransactionHistory.tsx": "Displays the user's transaction history with search, tabbed filtering by type (wins, purchases, deposits, withdrawals, bonuses), and summary stats for winnings, spending, and bonuses.",
  "frontend/src/pages/UserDashboard.tsx": "User dashboard showing account overview cards for coin balance, active lotteries, and tickets, with quick-action buttons for adding balance and withdrawing.",
  "frontend/src/pages/WithdrawalRequest.tsx": "A user-facing page for submitting coin withdrawal requests via UPI or bank transfer, with form validation, balance checks, and a history list of past withdrawal requests.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting URL parameters from both query strings and hash-based routing, with sessionStorage persistence helpers and a function to clean sensitive params from the URL hash.",
  "frontend/src/utils/validation.ts": "Collection of validation and formatting utility functions for email, password, amounts, ticket numbers, dates, coins, and a simple password hashing helper.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration for the frontend, extending the default theme with custom colors (gold, charcoal, cream), fonts (Playfair Display, Inter), shadows, border radii, and animations, using oklch color space and plugins for typography, container queries, and animate.",
  "project_state.json": "Project state document (version 25) describing the full-stack lottery coin system's architecture, features, known issues (rendering bugs, admin login hash mismatch, winner payout validation cap), and a comprehensive list of existing and planned features across frontend and backend."
}