{
  "backend/main.mo": "Main Motoko actor for the lottery system, defining all core types (UserProfile, LotteryPool, Ticket, WalletTransaction, etc.) and mixing in authorization and blob storage functionality.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs and titles to their associated frontend files, components, test IDs, and confidence levels for the lottery app build.",
  "frontend-file-summaries.txt": "A JSON-formatted reference document summarizing the intended implementation details and correct hook/import names for each frontend source file in the project.",
  "frontend/index.css": "Global Tailwind CSS stylesheet defining CSS custom properties for light and dark theme color tokens used throughout the application.",
  "frontend/index.html": "HTML entry point for the React app titled 'Lottery Coin System', mounting the app at the #root div and loading main.tsx as a module.",
  "frontend/src/App.tsx": "Root React application file that sets up TanStack Router with all user-facing and admin routes, wraps the app in AuthProvider/QueryClientProvider/ThemeProvider, and renders the Navbar and ProfileSetupModal in the root layout.",
  "frontend/src/components/AdminActionLogsTable.tsx": "React component that fetches and displays a sorted table of admin action logs (block, unblock, role change) with badges, timestamps, and loading skeletons.",
  "frontend/src/components/BlockUserModal.tsx": "A modal dialog that allows admins to block a user with an optional reason, using the `useBlockUser` mutation hook and displaying success/error toasts.",
  "frontend/src/components/CountdownTimer.tsx": "A countdown timer component that calculates and displays days/hours/minutes/seconds remaining until a target bigint timestamp, updating every second and turning red when under one hour.",
  "frontend/src/components/CreatePromotionDialog.tsx": "A dialog form for creating a new promotion, supporting multiple promotion types with conditional discount/bonus fields, validation, and submission via the `useCreatePromotion` mutation.",
  "frontend/src/components/EditPromotionDialog.tsx": "A dialog form for editing an existing promotion's description, discount, bonus, and time fields, pre-populated from the promotion prop and submitted via the `useUpdatePromotion` mutation.",
  "frontend/src/components/LoadingSpinner.tsx": "Exports a configurable spinning loader component in three sizes and a full-page `PageLoader` wrapper centered on the screen.",
  "frontend/src/components/LotteryCard.tsx": "Displays a lottery's details (name, prize pool, ticket price, fill progress, draw time) in a card, using live stats from `useGetLotteryLiveStats` and showing digit-count and interval badges.",
  "frontend/src/components/Navbar.tsx": "A sticky top navigation bar with logo, dynamic nav links based on auth state, an admin panel link for admin users, a coin balance display, and login/logout functionality via Internet Identity.",
  "frontend/src/components/NumberPicker.tsx": "A multi-digit number input component that renders individual digit boxes with keyboard navigation, backspace handling, and paste support, grouped visually with dashes.",
  "frontend/src/components/PaymentProofUpload.tsx": "A file upload component for payment proof images that supports drag-and-drop and click-to-upload, displays a preview with a clear button, and returns the file as a base64 string.",
  "frontend/src/components/ProfileSetupModal.tsx": "A modal dialog that collects a display name and optional email from a new user and saves their profile to the backend canister via the actor.",
  "frontend/src/components/PromotionBanner.tsx": "A styled banner component that displays promotion details (type, discount, bonus, description, end date) with type-specific icons, labels, and color schemes.",
  "frontend/src/components/TicketCard.tsx": "A card component that displays a lottery ticket's number, purchase date, and winner status, showing prize amount and a link to results for winning tickets.",
  "frontend/src/components/ToastContainer.tsx": "A fixed-position toast notification container that renders success, error, and info toasts with icons and a dismiss button, consuming the ToastContext.",
  "frontend/src/components/TransactionRow.tsx": "A row component that displays a single transaction with a type-specific icon, label, formatted amount with sign, and timestamp, supporting various transaction types like wins, purchases, and bonuses.",
  "frontend/src/components/UnblockUserModal.tsx": "A confirmation dialog modal that allows admins to unblock a user, calling the unblockUser mutation and showing success/error toasts.",
  "frontend/src/contexts/AuthContext.tsx": "Provides authentication context including user profile state, profile fetching logic, and helpers for profile setup completion and refetching, built on top of Internet Identity and the backend actor.",
  "frontend/src/contexts/ToastContext.tsx": "Provides a toast notification context with helpers for showing success, error, and info toasts that auto-dismiss after 4 seconds.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an authenticated or anonymous backend actor using React Query, invalidating dependent queries whenever the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity authentication via DFINITY's AuthClient, exposing login/logout functions, identity state, and a React context provider for use throughout the app.",
  "frontend/src/hooks/useQueries.ts": "Defines all React Query hooks and TypeScript interfaces for interacting with the backend, covering lottery pools, user profiles, wallet transactions, balance requests, withdrawals, promotions, and admin operations.",
  "frontend/src/index.css": "Global stylesheet that sets up Tailwind CSS, imports Google Fonts, defines CSS custom properties for the dark gold-themed design system, and adds custom utility classes and animations.",
  "frontend/src/lib/utils.ts": "Utility functions for class name merging, formatting coin amounts, dates, countdown timers, and draw interval labels/colors.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with QueryClientProvider and InternetIdentityProvider wrappers.",
  "frontend/src/pages/AddBalance.tsx": "Page that allows users to submit a balance top-up request by entering an amount (with quick-select buttons) and a payment screenshot URL, then awaits admin approval.",
  "frontend/src/pages/admin/AdminDashboard.tsx": "Admin dashboard showing platform stats (revenue, active users, lotteries, pending approvals) and a grid of quick-action links to key admin management pages.",
  "frontend/src/pages/admin/BalanceRequests.tsx": "Admin page for reviewing user balance top-up requests with filtering by status (pending/approved/rejected) and actions to approve or reject each request with optional notes.",
  "frontend/src/pages/admin/DrawDeclaration.tsx": "Admin page for declaring lottery draw results by selecting an active lottery pool, entering a winning number, and displaying the resulting winners with rank-styled cards.",
  "frontend/src/pages/admin/LotteryManagement.tsx": "Admin page for creating and managing lottery pools, including a creation form with prize ratios and draw settings, and controls to update the status of existing pools.",
  "frontend/src/pages/admin/Promotions.tsx": "Admin page for managing promotions, allowing creation and editing of promotion campaigns and granting coin bonuses directly to specific users.",
  "frontend/src/pages/admin/UserManagement.tsx": "Admin page for managing user accounts with search, block/unblock, role assignment, and manual coin credit functionality displayed in a filterable list.",
  "frontend/src/pages/admin/WithdrawalManagement.tsx": "Admin page for managing user withdrawal requests with filter tabs (all/pending/completed/rejected) and approve/reject actions with optional admin notes.",
  "frontend/src/pages/BuyTicket.tsx": "Page for purchasing a lottery ticket for a specific pool, supporting manual or auto-generated ticket numbers, displaying applicable promotions/discounts, and enforcing per-user limits and balance checks.",
  "frontend/src/pages/DrawResults.tsx": "Page that displays the draw results for a specific lottery, showing the winning number, prize distribution stats, and a ranked winners list.",
  "frontend/src/pages/Landing.tsx": "Public marketing landing page showcasing the LuckyCoins platform with a hero section, stats banner, and feature highlights linking to lotteries and login.",
  "frontend/src/pages/Login.tsx": "Login page that authenticates users via Internet Identity, redirecting to the dashboard upon success and displaying security/onboarding info.",
  "frontend/src/pages/LotteryList.tsx": "Page listing all active lottery pools with search and draw-interval filter controls, rendering results in a responsive grid of LotteryCard components.",
  "frontend/src/pages/MyTickets.tsx": "Displays the current user's lottery tickets with stats (total, won, winnings) and tabbed views for all, won, and pending tickets using data from query hooks.",
  "frontend/src/pages/Register.tsx": "Registration page that authenticates new users via Internet Identity, redirecting to the dashboard on success and displaying feature highlights.",
  "frontend/src/pages/TransactionHistory.tsx": "Shows the user's transaction history with summary stats (winnings, spent, bonuses), a search filter, and tabbed views by transaction type.",
  "frontend/src/pages/UserDashboard.tsx": "User dashboard displaying account overview cards for coin balance, active lotteries, and tickets, with quick-action links to add balance, withdraw, and browse lotteries.",
  "frontend/src/pages/WithdrawalRequest.tsx": "Withdrawal request page allowing users to submit coin withdrawals via UPI or bank transfer, with balance validation and a history of past withdrawal requests.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting URL parameters from both query strings and hash-based routing, with sessionStorage persistence helpers and a function to clean sensitive params from the URL hash.",
  "frontend/src/utils/validation.ts": "Collection of validation and formatting utility functions covering email, password, required fields, coin amounts, ticket numbers, dates, and a simple password hashing helper.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with dark mode, custom OKLCH-based color palette (gold, charcoal, cream, semantic tokens), custom fonts, shadows, border radii, and accordion keyframe animations.",
  "project_state.json": "Project state snapshot (version 11) describing the full-stack lottery coin system's architecture, features, DB schema, background jobs, prize distribution rules, and known rendering issues after version 3 deployment."
}