{
  "backend/main.mo": "Main Motoko actor for a lottery coin system, defining all core types (users, lottery pools, tickets, transactions, withdrawals) and mixing in authorization and blob storage functionality.",
  "feature_evidence.json": "Feature evidence report confirming that the Navbar component implements an admin-only 'Admin Panel' link navigating to /admin/dashboard with gold-and-dark theme styling.",
  "frontend-file-summaries.txt": "A JSON-formatted reference document summarizing the purpose and key implementation details of each frontend source file in the project.",
  "frontend/index.css": "Global Tailwind CSS stylesheet defining CSS custom properties for light and dark theme color tokens used throughout the application.",
  "frontend/index.html": "HTML entry point for the React app, mounting the root div and loading the main TypeScript module.",
  "frontend/src/App.tsx": "Root React application file that sets up TanStack Router with all page routes (user and admin), auth guards, error boundaries, and the global layout with Navbar and ProfileSetupModal.",
  "frontend/src/components/AdminActionLogsTable.tsx": "React component that fetches and displays a sorted table of admin action logs (block, unblock, role change) with badges, timestamps, and loading skeletons.",
  "frontend/src/components/BlockUserModal.tsx": "Modal dialog component that allows admins to block a user with an optional reason, calling the useBlockUser mutation and showing success/error toasts.",
  "frontend/src/components/CountdownTimer.tsx": "A React countdown timer component that calculates and displays time remaining until a target bigint timestamp, updating every second and showing urgency styling when under one hour.",
  "frontend/src/components/CreatePromotionDialog.tsx": "A dialog form component for creating new promotions with fields for type, description, discount/bonus amounts, and start/end times, using the useCreatePromotion mutation hook.",
  "frontend/src/components/CreditCoinsModal.tsx": "A modal dialog that allows admins to credit a specified coin amount to a selected user via the useGrantAdminBonus hook, with quick-amount buttons and validation.",
  "frontend/src/components/EditPromotionDialog.tsx": "A dialog form for editing an existing promotion's description, discount, bonus amount, and time fields, pre-populated from the promotion prop and submitted via useUpdatePromotion.",
  "frontend/src/components/LoadingSpinner.tsx": "Provides a reusable animated spinner component in three sizes and a full-page PageLoader wrapper centered on the screen.",
  "frontend/src/components/LotteryCard.tsx": "Displays a lottery's details (name, prize pool, ticket price, fill progress, draw time) in a card layout, using live stats from useGetLotteryLiveStats and badge helpers for draw interval and digit type.",
  "frontend/src/components/Navbar.tsx": "A sticky top navigation bar with logo, dynamic nav links based on auth state, an admin panel link for admin users, a coin balance display, and login/logout functionality via Internet Identity.",
  "frontend/src/components/NumberPicker.tsx": "A multi-digit number input component that renders individual digit boxes with keyboard navigation, backspace handling, and paste support, grouped visually with dashes.",
  "frontend/src/components/PaymentProofUpload.tsx": "A file upload component for payment proof images that supports drag-and-drop and click-to-upload, converts the file to base64, and shows a preview with a clear button.",
  "frontend/src/components/ProfileSetupModal.tsx": "A modal dialog that prompts new users to enter a display name and email, then saves the profile via the backend actor, handling known errors like uninitialized accounts.",
  "frontend/src/components/PromotionBanner.tsx": "A styled banner component that displays promotion details (type, discount, bonus, description, expiry) with type-specific icons, labels, and color schemes.",
  "frontend/src/components/QuickCreditCoinsCard.tsx": "An admin card component with a searchable user selector and amount input that allows instantly crediting coins to a selected user via the grantAdminBonus mutation.",
  "frontend/src/components/TicketCard.tsx": "Displays a single lottery ticket's details including ticket number, purchase date, and winner status with prize amount and a link to view results.",
  "frontend/src/components/ToastContainer.tsx": "A fixed-position toast notification container that renders success, error, and info toasts from the ToastContext with animated slide-in and dismiss buttons.",
  "frontend/src/components/TransactionRow.tsx": "Renders a single transaction row with an icon, label, amount, and date based on transaction type (win, buy_ticket, withdraw, bonuses, etc.). Supports navigation to related lottery pool pages via an external link icon.",
  "frontend/src/components/UnblockUserModal.tsx": "A confirmation dialog modal that allows admins to unblock a user by calling the useUnblockUser mutation, showing loading state and success/error toasts.",
  "frontend/src/contexts/AuthContext.tsx": "Provides authentication state and user profile management via React context, fetching the caller's profile from the backend actor and handling profile setup, errors, and re-fetching.",
  "frontend/src/contexts/ToastContext.tsx": "Provides a React context for managing toast notifications with success, error, and info variants, auto-removing them after 4 seconds.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous ICP backend actor using React Query, reinitializing and invalidating dependent queries when the identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity authentication via AuthClient, exposing login/logout functions, identity state, and login status through a React context and hook.",
  "frontend/src/hooks/useQueries.ts": "Centralizes all React Query hooks for backend interactions including user profiles, lottery pools, tickets, transactions, admin operations, and user management mutations.",
  "frontend/src/index.css": "Global stylesheet that imports Google Fonts (Playfair Display, Inter), sets up Tailwind base/components/utilities, defines CSS custom properties for a dark gold-themed design system, and adds custom utility classes and keyframe animations.",
  "frontend/src/lib/utils.ts": "Utility module exporting a Tailwind class merger (cn), and formatting helpers for coin amounts, dates, time remaining, and draw interval labels/colors.",
  "frontend/src/main.tsx": "React app entry point that mounts the app with QueryClientProvider and InternetIdentityProvider wrappers.",
  "frontend/src/pages/AddBalance.tsx": "Page component allowing users to submit a coin balance top-up request by entering an amount and a payment screenshot URL, with quick-select amount buttons and a success confirmation state.",
  "frontend/src/pages/admin/AdminDashboard.tsx": "Admin dashboard page showing platform stats (revenue, users, lotteries, pending approvals) and quick-action links to key admin sections.",
  "frontend/src/pages/admin/BalanceRequests.tsx": "Admin page for reviewing user balance top-up requests, with filterable tabs and approve/reject actions per request.",
  "frontend/src/pages/admin/DrawDeclaration.tsx": "Admin page for declaring lottery draw results by selecting an active lottery pool and entering a winning number, then displaying the resulting winners.",
  "frontend/src/pages/admin/LotteryManagement.tsx": "Admin page for creating and managing lottery pools, including a creation form with prize ratios and draw settings, and status update controls for existing pools.",
  "frontend/src/pages/admin/Promotions.tsx": "Admin page for managing promotions, allowing creation, editing, deactivation, and granting bonus coins to users, with a table listing all promotions and their statuses.",
  "frontend/src/pages/admin/UserManagement.tsx": "Admin page for listing, searching, blocking/unblocking users, assigning roles, and crediting coins via a modal.",
  "frontend/src/pages/admin/WithdrawalManagement.tsx": "Admin page for viewing, filtering, approving, and rejecting user withdrawal requests with optional admin notes.",
  "frontend/src/pages/BuyTicket.tsx": "Page component for purchasing a lottery ticket for a specific pool, supporting manual or auto-generated ticket numbers, displaying applicable promotions/discounts, and enforcing per-user ticket limits and balance checks.",
  "frontend/src/pages/DrawResults.tsx": "Page component that displays the draw results for a specific lottery, showing the winning number, prize distribution stats, and a ranked winners list.",
  "frontend/src/pages/Landing.tsx": "Marketing landing page featuring a hero section, platform stats banner, and feature highlights for the LuckyCoins blockchain lottery platform.",
  "frontend/src/pages/Login.tsx": "Login page that authenticates users via Internet Identity, redirecting to the dashboard on success and displaying security info blurbs.",
  "frontend/src/pages/LotteryList.tsx": "Displays a searchable, filterable grid of active lottery pools fetched from the backend, with skeleton loading states and interval-based filter buttons.",
  "frontend/src/pages/MyTickets.tsx": "Shows the authenticated user's tickets in All/Won/Pending tabs with summary stats for total tickets, wins, and total winnings.",
  "frontend/src/pages/Register.tsx": "Registration page that uses Internet Identity login to create a new account, nearly identical to Login but with registration-focused copy and a welcome bonus note.",
  "frontend/src/pages/TransactionHistory.tsx": "Displays the user's transaction history with summary stats (winnings, spent, bonuses) and tabbed filtering by transaction type, plus a description search input.",
  "frontend/src/pages/UserDashboard.tsx": "User dashboard showing coin balance, active lottery count, and ticket summary cards with quick-action buttons for adding balance, withdrawing, and browsing lotteries.",
  "frontend/src/pages/WithdrawalRequest.tsx": "Page component that allows users to submit coin withdrawal requests via UPI or bank transfer, and displays their withdrawal history with status badges.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading URL query parameters (including hash-based routing), persisting them to sessionStorage, and cleaning sensitive params from the URL hash.",
  "frontend/src/utils/validation.ts": "Collection of validation and formatting helper functions for email, password, amounts, ticket numbers, dates, coins, and password hashing.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining dark mode, custom color tokens (gold, charcoal, cream, sidebar, chart), typography, border radius, box shadows, and animation keyframes.",
  "project_state.json": "Tracks the full project state (version 17) for a lottery coin system with React/Node/MySQL stack, documenting architectural notes, existing features, known issues, and planned work including auth, wallet, lottery draws, admin panel, and bonus systems."
}