{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix blank screen rendering — full frontend visibility audit and repair",
  "requirements": [
    {
      "id": "REQ-37",
      "summary": "Audit and fix App.tsx router configuration to ensure all user-facing and admin routes render without blank screens",
      "acceptanceCriteria": [
        "Navigating to / renders the Landing page without a blank screen.",
        "Navigating to /login renders the Login page.",
        "Navigating to /dashboard renders the UserDashboard page for authenticated users.",
        "All admin routes under /admin/* render their respective admin page components.",
        "No route results in a blank white screen or an unhandled route error."
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Verify all routes (/, /login, /register, /dashboard, /lotteries, /lotteries/:id/buy, /my-tickets, /add-balance, /withdraw, /transactions, /results/:lotteryId, and all /admin/* routes) are correctly registered with TanStack Router and reference the correct imported page components. Ensure no route definition is missing a component assignment or has an incorrect import path. Add error boundaries to catch routing errors and display fallback UI instead of blank screens."
        }
      ]
    },
    {
      "id": "REQ-38",
      "summary": "Audit and fix AuthContext to correctly fetch and store user profile after Internet Identity login",
      "acceptanceCriteria": [
        "After Internet Identity login, the user's display name and coin balance appear in the Navbar within 3 seconds.",
        "Unauthenticated navigation to /dashboard redirects to /login.",
        "Authenticated admin navigation to /admin/dashboard renders the Admin Dashboard without redirect.",
        "AuthContext loading state prevents a flash of unauthenticated UI on page reload."
      ],
      "file_operations": [
        {
          "path": "frontend/src/contexts/AuthContext.tsx",
          "operation": "modify",
          "description": "Ensure the AuthContext correctly calls getCallerUserProfile after Internet Identity login and updates the context state with the returned UserProfile. Add proper loading state management to prevent premature rendering of unauthenticated UI. Verify that the context provider is correctly exposing isAuthenticated, user profile data, and loading states. Add error handling for failed profile fetches that displays an error message instead of leaving the screen blank. Ensure the context properly transitions from loading to authenticated state after successful login and profile fetch."
        }
      ]
    },
    {
      "id": "REQ-39",
      "summary": "Audit and fix Navbar component to render correctly on every page with proper authentication state display",
      "acceptanceCriteria": [
        "The Navbar is visible on every page including the Landing page.",
        "Authenticated users see their coin balance and display name in the Navbar.",
        "Unauthenticated users see only the logo and a Login button.",
        "Admin users see an 'Admin Panel' link in the Navbar."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/Navbar.tsx",
          "operation": "modify",
          "description": "Verify the Navbar component correctly consumes AuthContext values (isAuthenticated, user profile, role). Ensure the component is mounted at the application root level in App.tsx. Fix any CSS/z-index issues that may be hiding the Navbar. Add conditional rendering logic to display logo + Login button for unauthenticated users, and logo + coin balance + display name + logout button for authenticated users. For admin users, add an 'Admin Panel' navigation link. Ensure the Navbar does not render blank or invisible due to missing context values or CSS issues."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Ensure the Navbar component is rendered at the root layout level so it appears on every route. Verify the Navbar is placed outside route-specific content and is always visible regardless of the current route. Confirm that AuthContext is available to the Navbar by ensuring the provider hierarchy is correct."
        }
      ]
    },
    {
      "id": "REQ-40",
      "summary": "Audit and fix Admin panel layout to ensure all admin sub-pages are accessible and render correctly",
      "acceptanceCriteria": [
        "Clicking each sidebar link in the admin panel navigates to the correct admin sub-page.",
        "All admin sub-pages render their content (tables, forms, stats) without a blank screen.",
        "The admin sidebar is visible on all /admin/* routes.",
        "Non-admin users attempting to access /admin/* are redirected to /dashboard."
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Verify all /admin/* routes (AdminDashboard, BalanceRequests, WithdrawalManagement, LotteryManagement, UserManagement, Promotions, DrawDeclaration) are correctly registered with TanStack Router and reference the correct imported page components. Ensure a shared admin layout wrapper component is applied to all /admin/* routes that renders the admin sidebar navigation. Add route guards that redirect non-admin users attempting to access /admin/* routes to /dashboard. Ensure the admin layout wrapper does not prevent page content from rendering."
        },
        {
          "path": "frontend/src/pages/admin/AdminDashboard.tsx",
          "operation": "modify",
          "description": "Verify the AdminDashboard page correctly renders platform stats and quick-action links. Ensure the page handles loading states and does not render blank while fetching data. Add error handling for failed data fetches that displays an error message instead of a blank screen."
        },
        {
          "path": "frontend/src/pages/admin/BalanceRequests.tsx",
          "operation": "modify",
          "description": "Verify the BalanceRequests page correctly renders the list of pending balance requests. Ensure the page handles loading states and does not render blank while fetching data. Add error handling for failed data fetches."
        },
        {
          "path": "frontend/src/pages/admin/WithdrawalManagement.tsx",
          "operation": "modify",
          "description": "Verify the WithdrawalManagement page correctly renders withdrawal request tabs and lists. Ensure the page handles loading states and does not render blank while fetching data. Add error handling for failed data fetches."
        },
        {
          "path": "frontend/src/pages/admin/LotteryManagement.tsx",
          "operation": "modify",
          "description": "Verify the LotteryManagement page correctly renders the lottery pool list and management interface. Ensure the page handles loading states and does not render blank while fetching data. Add error handling for failed data fetches."
        },
        {
          "path": "frontend/src/pages/admin/UserManagement.tsx",
          "operation": "modify",
          "description": "Verify the UserManagement page correctly renders the user search and management interface. Ensure the page handles loading states and does not render blank while fetching data. Add error handling for failed data fetches."
        },
        {
          "path": "frontend/src/pages/admin/Promotions.tsx",
          "operation": "modify",
          "description": "Verify the Promotions page correctly renders the promotions list and management interface. Ensure the page handles loading states and does not render blank while fetching data. Add error handling for failed data fetches."
        },
        {
          "path": "frontend/src/pages/admin/DrawDeclaration.tsx",
          "operation": "modify",
          "description": "Verify the DrawDeclaration page correctly renders the draw declaration interface. Ensure the page handles loading states and does not render blank while fetching data. Add error handling for failed data fetches."
        }
      ]
    },
    {
      "id": "REQ-41",
      "summary": "Audit and fix useQueries.ts hooks to ensure queries wait for actor initialization and display loading states",
      "acceptanceCriteria": [
        "No page renders blank due to actor being null during the initial load.",
        "All useQuery hooks that depend on the actor have enabled: !!actor guards.",
        "A loading spinner or skeleton is shown while the actor is initialising.",
        "After actor is ready, queries execute and their data renders on the page."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Audit all React Query hooks to ensure they include enabled: !!actor && !actorFetching guards so queries do not execute when the actor is null or still initializing. For hooks that return user-facing data, ensure the returned state includes proper isLoading logic that accounts for both actorFetching and query loading states (e.g., isLoading: actorFetching || query.isLoading). Add null-checks before calling actor methods to prevent silent failures. Ensure hooks return isFetched only when the actor is ready and the query has completed."
        },
        {
          "path": "frontend/src/pages/Landing.tsx",
          "operation": "modify",
          "description": "Ensure the Landing page renders its hero section and features immediately without waiting for actor initialization, since it is a public marketing page that should not depend on authentication or backend data."
        },
        {
          "path": "frontend/src/pages/Login.tsx",
          "operation": "modify",
          "description": "Ensure the Login page displays a loading spinner during the Internet Identity authentication flow and does not render blank. Add error handling for failed login attempts that displays an error message instead of a blank screen."
        },
        {
          "path": "frontend/src/pages/UserDashboard.tsx",
          "operation": "modify",
          "description": "Ensure the UserDashboard page displays a loading state (spinner or skeleton) while the actor is initializing and user data is being fetched. Add error handling for failed data fetches that displays an error message instead of a blank screen. Ensure the page does not render blank if any query fails."
        },
        {
          "path": "frontend/src/pages/LotteryList.tsx",
          "operation": "modify",
          "description": "Ensure the LotteryList page displays skeleton loaders while the actor is initializing and lottery data is being fetched. Add error handling for failed data fetches that displays an error message instead of a blank screen."
        },
        {
          "path": "frontend/src/pages/MyTickets.tsx",
          "operation": "modify",
          "description": "Ensure the MyTickets page displays a loading state while the actor is initializing and ticket data is being fetched. Add error handling for failed data fetches that displays an error message instead of a blank screen."
        },
        {
          "path": "frontend/src/pages/TransactionHistory.tsx",
          "operation": "modify",
          "description": "Ensure the TransactionHistory page displays a loading state while the actor is initializing and transaction data is being fetched. Add error handling for failed data fetches that displays an error message instead of a blank screen."
        }
      ]
    },
    {
      "id": "REQ-42",
      "summary": "Audit and fix React Query configuration to ensure QueryClientProvider wraps the app and queries handle errors gracefully",
      "acceptanceCriteria": [
        "QueryClientProvider wraps the entire app at the root level.",
        "A failed query displays an error message UI rather than a blank page.",
        "No unhandled query error causes a full white-screen crash.",
        "The QueryClient is configured with retry: 1 and a staleTime appropriate for the app."
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Add error boundaries around route content to catch and display errors from failed queries instead of allowing the React tree to crash and produce a blank screen. Ensure error boundaries display a user-friendly error message with a retry button. Verify that QueryClientProvider is correctly wrapping the router and all route components have access to React Query context."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Review all query hooks to ensure they have proper error handling. Add retry: 1 configuration to queries where appropriate to prevent excessive retries on transient failures. Ensure queries return error states that components can use to render error UI instead of blank screens. For critical queries that must succeed for the page to render, ensure the component using the hook displays an error message when the query fails."
        }
      ]
    },
    {
      "id": "REQ-43",
      "summary": "Audit and fix global CSS and Tailwind configuration to ensure all page content is visible with the dark gold theme",
      "acceptanceCriteria": [
        "The app body has the deep charcoal background (#1a1a2e or equivalent) applied.",
        "Body text is cream/white and visible against the dark background.",
        "No page section is invisible due to matching foreground and background colors.",
        "The root div fills the full viewport height and width."
      ],
      "file_operations": [
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Verify that the global body styles apply the deep charcoal background color and cream/white text color so that page content is visible. Ensure CSS custom properties for the dark gold theme are correctly defined and applied. Check that the root element has proper height and width styles (min-h-screen or h-full) so the app fills the viewport. Ensure no CSS rules are hiding content by setting matching foreground and background colors."
        },
        {
          "path": "frontend/index.html",
          "operation": "modify",
          "description": "Verify the root div in index.html has the correct class or inline style to ensure the app fills the viewport and is visible. Ensure the body and html elements have proper height/width styles. Add dark class to the root div or html element if required by the Tailwind dark mode configuration."
        }
      ]
    }
  ]
}